using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace RL
{
    public class HelpText
    {
        public static string CapacitorHelp = @"В окне “Конденсатор” представлена электрическая цепь, параметры этой цепи, а также график зависимости напряжения на конденсаторе и тока через него от времени.
Цепь имеет два режима работы: зарядка конденсатора от источника напряжения и разрядка конденсатора через резистор. Для переключения между режимами необходимо нажать на цепь.";

        public static string CoilHelp = @"В окне “Катушка” представлена электрическая цепь, параметры этой цепи, а также график зависимости напряжения на катушке и тока через нее от времени.
Цепь имеет два режима работы: зарядка катушки от источника напряжения и разрядка катушки через резистор. Для переключения между режимами необходимо нажать на цепь.";
        
        public static string RLCHelp = @"В окне “Колебательный контур” представлена электрическая цепь, параметры этой цепи, а также график зависимости напряжения в колебательном контуре и тока через него от времени.
Цепь имеет два режима работы: зарядка конденсатора в цепи от источника напряжения и режим свободных колебаний. Для переключения между режимами необходимо нажать на цепь.";

        public static string ResonanceHelp = @"В окне “Резонанс” представлена электрическая цепь, параметры этой цепи, а также график зависимости напряжения в колебательном контуре и тока через него от времени.
Цепь имеет два режима работы: зарядка конденсатора в цепи от источника напряжения и режим свободных колебаний. Для переключения между режимами необходимо нажать на цепь.";
    }
}
